# SQL: Creating databases from scratch

First lets setup the notebook

**Notice** SQLite supports a limited subset of ALTER TABLE. The ALTER TABLE command in SQLite allows the user to rename a table or to add a new column to an existing table. It is not possible to rename a column, remove a column, or add or remove constraints from a table.

In [9]:
#!/opt/anaconda3/bin/pip install mysqlclient
#!/opt/anaconda3/bin/pip install mysql-python
#!pip install update sqlite3
#!pip install sqlalchemy

In [26]:
#load libraries
import sqlalchemy
from sqlalchemy import  create_engine
import sqlite3 as sql
import pandas as pd

#show all results per chunk
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [ ]:
#export LD_LIBRARY_PATH="/usr/local/lib"

In [27]:
import sqlite3 as sql
sql.sqlite_version

'3.31.1'

In [28]:
#setup empty connection
pet_db = create_engine("sqlite:///:memory:")

In [29]:
#load sql module, use reload if already done
%reload_ext sql

In [12]:
#sql.version
#import sys
#print(sys.path)

In [13]:
#import os
#os.path.abspath(sql.__file__)
#os.path.basename(sql)
#pysqlite2

'/opt/anaconda3/lib/python3.7/sqlite3/__init__.py'

In [30]:
%sql sqlite:///pet_db

In [31]:
%%sql
CREATE TABLE PETSALE (
    ID INTEGER NOT NULL,
    PET CHAR(20),
    SALEPRICE DECIMAL(6,2),
    PROFIT DECIMAL(6,2),
    SALEDATE DATE
    );

 * sqlite:///pet_db
(sqlite3.OperationalError) table PETSALE already exists
[SQL: CREATE TABLE PETSALE (
    ID INTEGER NOT NULL,
    PET CHAR(20),
    SALEPRICE DECIMAL(6,2),
    PROFIT DECIMAL(6,2),
    SALEDATE DATE
    );]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [32]:
%%sql
CREATE TABLE PET (
    ID INTEGER NOT NULL,
    ANIMAL VARCHAR(20),
    QUANTITY INTEGER
    );

 * sqlite:///pet_db
(sqlite3.OperationalError) table PET already exists
[SQL: CREATE TABLE PET (
    ID INTEGER NOT NULL,
    ANIMAL VARCHAR(20),
    QUANTITY INTEGER
    );]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [33]:
%%sql
select * from PET

 * sqlite:///pet_db
Done.

[(1, 'Cat', 2), (2, 'Dog', 4), (3, 'Hamster', 2)]

In [34]:
%%sql
--Add values into petsale
INSERT INTO PETSALE VALUES
    (1,'Cat',450.09,100.47,'2018-05-29'),
    (2,'Dog',666.66,150.76,'2018-06-01'),
    (3,'Parrot',50.00,8.9,'2018-06-04'),
    (4,'Hamster',60.60,12,'2018-06-11'),
    (5,'Goldfish',48.48,3.5,'2018-06-14');

--Add values into PET
INSERT INTO PET VALUES
    (1,'Cat',2),
    (2,'Dog',4),
    (3,'Hamster',2);

 * sqlite:///pet_db
(sqlite3.OperationalError) table PETSALE has 6 columns but 5 values were supplied
[SQL: --Add values into petsale
INSERT INTO PETSALE VALUES
    (1,'Cat',450.09,100.47,'2018-05-29'),
    (2,'Dog',666.66,150.76,'2018-06-01'),
    (3,'Parrot',50.00,8.9,'2018-06-04'),
    (4,'Hamster',60.60,12,'2018-06-11'),
    (5,'Goldfish',48.48,3.5,'2018-06-14');]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [35]:
%%sql
select * from Petsale;

 * sqlite:///pet_db
Done.

[(1, 'Cat', 450.09, 100.47, '2018-05-29', 9),
 (2, 'Dog', 666.66, 150.76, '2018-06-01', 40),
 (3, 'Parrot', 50, 8.9, '2018-06-04', 9),
 (4, 'Hamster', 60.6, 12, '2018-06-11', 9),
 (5, 'Goldfish', 48.48, 3.5, '2018-06-14', 9)]

Add a new QUANTITY column to the PETSALE table and show the altered table. Copy the code below and paste it to the textbox of the Run SQL page. Click Run all.

In [20]:
%%sql
Alter table PETSALE
ADD column QUANTITY integer;

select * from PETSALE

 * sqlite:///pet_db
(sqlite3.OperationalError) duplicate column name: QUANTITY
[SQL: Alter table PETSALE
ADD column QUANTITY integer;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [36]:
%%sql
UPDATE PETSALE SET QUANTITY = 9 WHERE ID = 1;
UPDATE PETSALE SET QUANTITY = 40 WHERE ID = 2;
UPDATE PETSALE SET QUANTITY = 9 WHERE ID = 3;
UPDATE PETSALE SET QUANTITY = 2 WHERE ID = 4;
UPDATE PETSALE SET QUANTITY = 9 WHERE ID = 5;

select * from PETSALE

 * sqlite:///pet_db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Cat', 450.09, 100.47, '2018-05-29', 9),
 (2, 'Dog', 666.66, 150.76, '2018-06-01', 40),
 (3, 'Parrot', 50, 8.9, '2018-06-04', 9),
 (4, 'Hamster', 60.6, 12, '2018-06-11', 2),
 (5, 'Goldfish', 48.48, 3.5, '2018-06-14', 9)]

Delete the PROFIT column from the PETSALE table and show the altered table. Copy the code below and paste it to the textbox of the Run SQL page. Click Run all.

In [37]:
%%sql
Alter table PETSALE
drop column profit;

 * sqlite:///pet_db
(sqlite3.OperationalError) near "drop": syntax error
[SQL: Alter table PETSALE
drop column profit;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [38]:
%%sql
select * from PETSALE;

 * sqlite:///pet_db
Done.

[(1, 'Cat', 450.09, 100.47, '2018-05-29', 9),
 (2, 'Dog', 666.66, 150.76, '2018-06-01', 40),
 (3, 'Parrot', 50, 8.9, '2018-06-04', 9),
 (4, 'Hamster', 60.6, 12, '2018-06-11', 2),
 (5, 'Goldfish', 48.48, 3.5, '2018-06-14', 9)]

In [40]:
%%sql
drop table petsale;

 * sqlite:///pet_db
Done.

[]